/*
	2022年6月17日11点10分
	C Primer Plus，floats.c
	目的：研究不同的修饰符对浮点数的作用
	作用：查看修饰符对浮点数的输出结果
*/
#include <stdio.h>
int main (){
	const double RENT = 3852.99;
	printf ("*%f*\n",RENT);                //默认，会打印数字所需的位数和小数点后的6位数字
	printf ("*%e*\n",RENT);                //%e，科学计数法，会打印数字所需位数和小数点右侧的6个数字
	printf ("*%4.2f*\n",RENT);             //.2表示后面要输出两个小数
	printf ("*%3.1f*\n",RENT);             //输出3位，要求有一个小数，这里会四舍五入
	printf ("*%10.3f*\n",RENT);            //输出包含小数及小数点的10位数，有3个小数
	printf ("*%10.3E*\n",RENT);            //用科学计数法输出包含小数及小数点的10位数，有3个小数，这里会四舍五入，E还会大写
	printf ("*%+4.2f*\n",RENT);            //有+号，输出4位，包含两位小数的数字
	printf ("*%010.2f*\n",RENT);           //10位所不够用的空格用0来填充
	return 0;
}
/*

命令行输出结果：
*3852.990000*
*3.852990e+003*
*3852.99*
*3853.0*
*  3852.990*
*3.853E+003*
*+3852.99*
*0003852.99*

*/