/*
2022年8月9日17点01分
用冒泡排序来完成对动态输入学生成绩数组的排序
*/

#include <stdio.h>
#include <malloc.h>

void sort(float * a,int len){
	int i,j,t;
	
	for (i = 0;i<len-1;++i){
		
		for (j = 0;j<len-1-i;++j){
			
			if (a[j] > a[j+1]){
				
				t = a[j];
				a[j] = a[j+1];
				a[j+1] = t;
			}
		}
	}
	
	
}

int main (){
	int num;
	int i;
	printf ("请输入有多少个学生：");
	scanf ("%d",&num);
	
	//动态的构造一维数组
	float * p = (float *)malloc (4*num);
	
	for (i = 0;i<num;++i){
		scanf ("%f",&p[i]);
	}
	
	for (i = 0;i<num;++i){
		printf ("当前学生的成绩为：%f \n",p[i]);
	}
	
	sort(p,num);
	
	for (i = 0;i<num;++i){
		printf ("排序后学生的成绩为：%f\n",p[i]);
	}
	free(p);
}

/*
在命令行中的输出结果为：
-------------------------------
请输入有多少个学生：5
99.9
98.6
10.0
55.2
30.4
当前学生的成绩为：99.900002
当前学生的成绩为：98.599998
当前学生的成绩为：10.000000
当前学生的成绩为：55.200001
当前学生的成绩为：30.400000
排序后学生的成绩为：10.000000
排序后学生的成绩为：30.400000
排序后学生的成绩为：55.000000
排序后学生的成绩为：98.000000
排序后学生的成绩为：99.000000
-------------------------------
*/