/*
2022年7月29日15点26分
使用函数来判断是不是素数
*/

#include <stdio.h>
#include <stdbool.h>

bool f(int m){                      //定义一个布尔值的返回类型的函数f，只接受一个形参
	int i;
	for (i = 2;i<m;++i){
		if (m%i == 0){
			break;
		}
	}
	if (i == m){
		return true;
	}else {
		return false;
	}
}

int main (){
	int a;                  //遍历所有的数字用
	int i;                  //参与判断是否是素数
	int val;                //接收数字用
	scanf ("%d",&val);      //接收用户所输入的数字
	
	//遍历到val之间的数字
	for (a = 2;a<=val;++a){
	//判断是否是素数
	if (f(a)){
		printf ("%d是素数\n",a);
	}else {
		printf ("%d不是素数\n",a);
	}
}
}

/*
在命令行中的输出结果为：
---------------------------------------
12
2是素数
3是素数
4不是素数
5是素数
6不是素数
7是素数
8不是素数
9不是素数
10不是素数
11是素数
12不是素数
---------------------------------------
*/