/*
2022年8月4日20点57分
确定一个一维数组需要几个参数
目的：关于数组的学习
*/

#include <stdio.h>
void f(int * pArr,int len){                  //数组的第一个元素表示第一个元素的地址，
											//用数组确定一个一维数组的长度需要用第一个元素的地址和数组的长度来确定
	int i;
	for (i = 0;i<len;++i){
		printf ("%d  ",*(pArr+i));          //*(pArr+i)表示每个元素的值
	}
	printf ("\n");
}
int main (){
	int a[5] = {1,2,3,4,5};
	int b[6] = {-1,-2,-3,4,5,6};
	int c [100] = {1,99,22,33};
	
	f(a,5);                                 //调用函数
	f(b,6);
	f(c,100);
}

/*
在命令行中的输出结果为：
-----------------------------------
1  2  3  4  5
-1  -2  -3  4  5  6
1  99  22  33  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0  0
-----------------------------------
*/